IDENTIFICATION DIVISION
PROGRAM-ID. CALLJAVA.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION
01  PARAM-1   PIC X(6).
01  PARAM-2.
      02  SUB-1    PIC 99.
      02  SUB-2    PIC 999.
………………………………………
PROCEDURE DIVISION.
MAIN-PARAGRAPH.
………………………………………
CALL "CalledFromCobol" USING PARAM-1 PARAM-2.
………………………………………
END-PARAGRAPH.
STOP RUN.
